Revit 2027 API
MaterialNode.Transparency Property
 The value of transparency the material is being rendered with
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Transparency { get; }
Public ReadOnly Property Transparency As Double
	Get
public:
property double Transparency {
	double get ();
}
member Transparency : float with get
Property Value
Double
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace